In [2]:
import pandas as pd, numpy as np

In [3]:
df=pd.read_excel('../team2.xlsx')
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [4]:
# 将Q1成绩按照60分以上和以下分类
pd.cut(df.Q1, bins=[0,60,100])

0    (60, 100]
1      (0, 60]
2      (0, 60]
3    (60, 100]
4    (60, 100]
5      (0, 60]
Name: Q1, dtype: category
Categories (2, interval[int64, right]): [(0, 60] < (60, 100]]

In [5]:
df.Q1.groupby(pd.cut(df.Q1, bins=[0,60,100])).count()

Q1
(0, 60]      3
(60, 100]    3
Name: Q1, dtype: int64

In [6]:
df.groupby(pd.cut(df.Q1, bins=[0,60,100])).count()

           name  team  Q1  Q2  Q3  Q4  1city  what color
Q1
(0, 60]       3     3   3   3   3   3      3           3
(60, 100]     3     3   3   3   3   3      3           3

In [7]:
df.Q1.groupby(pd.cut(df.Q1, bins=[0,60,100])).count()[1]

3

In [8]:
# 不使用标签，换成0，1，2，N形式
pd.cut(df.Q1, bins=[0,60,100], labels=False)

0    1
1    0
2    0
3    1
4    1
5    0
Name: Q1, dtype: int64

In [9]:
# 指定标签名
pd.cut(df.Q1, bins=[0,60,100], labels=['不及格','及格'])

0     及格
1    不及格
2    不及格
3     及格
4     及格
5    不及格
Name: Q1, dtype: category
Categories (2, object): ['不及格' < '及格']

In [10]:
# 包含最低部分
pd.cut(df.Q1, bins=[0,60,100], include_lowest=True)

0     (60.0, 100.0]
1    (-0.001, 60.0]
2    (-0.001, 60.0]
3     (60.0, 100.0]
4     (60.0, 100.0]
5    (-0.001, 60.0]
Name: Q1, dtype: category
Categories (2, interval[float64, right]): [(-0.001, 60.0] < (60.0, 100.0]]

In [11]:
# 关闭右包区间
pd.cut(df.Q1, bins=[0,60,100], right=False)

0    [60, 100)
1      [0, 60)
2      [0, 60)
3    [60, 100)
4    [60, 100)
5      [0, 60)
Name: Q1, dtype: category
Categories (2, interval[int64, left]): [[0, 60) < [60, 100)]

# 6.5.2 等宽分箱 pd.qcut()

In [12]:
# 按Q1成绩分成2组
pd.qcut(df.Q1,q=2)

0      (73.0, 93.0]
1    (23.999, 73.0]
2    (23.999, 73.0]
3      (73.0, 93.0]
4      (73.0, 93.0]
5    (23.999, 73.0]
Name: Q1, dtype: category
Categories (2, interval[float64, right]): [(23.999, 73.0] < (73.0, 93.0]]

In [13]:
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [14]:
# 查看分组区间
pd.qcut(df.Q1,q=2).unique()

[(73.0, 93.0], (23.999, 73.0]]
Categories (2, interval[float64, right]): [(23.999, 73.0] < (73.0, 93.0]]

In [15]:
pd.qcut(df.Q1,q=2).unique()[1]

Interval(23.999, 73.0, closed='right')

TypeError: 'pandas._libs.interval.Interval' object is not subscriptable